In [54]:
#Carga de los archivos
import pandas as pd
df_calendar = pd.read_excel('DIM_CALENDAR.xlsx')
df_category = pd.read_csv('DIM_CATEGORY.csv')
df_product = pd.read_excel('DIM_PRODUCT.xlsx')
df_segment = pd.read_excel('DIM_SEGMENT.xlsx')
df_fact_sales = pd.read_csv('FACT_SALES.csv')

In [24]:
df_calendar.head()

    WEEK  YEAR  MONTH  WEEK_NUMBER       DATE
0  01-21  2021      1            1 2021-01-10
1  02-21  2021      1            2 2021-01-17
2  03-21  2021      1            3 2021-01-24
3  04-21  2021      1            4 2021-01-31
4  05-21  2021      2            5 2021-02-07

In [25]:
df_calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   WEEK         156 non-null    object
 1   YEAR         156 non-null    int64
 2   MONTH        156 non-null    int64
 3   WEEK_NUMBER  156 non-null    int64
 4   DATE         156 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 6.2+ KB

In [26]:
df_calendar.describe()

              YEAR       MONTH  WEEK_NUMBER                 DATE
count   156.000000  156.000000   156.000000                  156
mean   2022.000000    6.487179    26.500000  2022-07-06 20:00:00
min    2021.000000    1.000000     1.000000  2021-01-10 00:00:00
25%    2021.000000    3.750000    13.750000  2021-10-08 06:00:00
50%    2022.000000    6.500000    26.500000  2022-07-06 12:00:00
75%    2023.000000    9.250000    39.250000  2023-04-04 18:00:00
max    2023.000000   12.000000    52.000000  2024-01-01 00:00:00
std       0.819126    3.459419    15.056667                  NaN

In [28]:
df_category.head()

   ID_CATEGORY                        CATEGORY
0            1  FABRIC TREATMENT and SANIT\r\n
1            2                       AIR CARE
2            3                    LAVAVAJILLAS
3            4                MEGA SUPERFICIES
4            5             LAVATORY CARE & BRC

In [29]:
df_category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID_CATEGORY  5 non-null      int64
 1   CATEGORY     5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [30]:
df_category.describe()

       ID_CATEGORY
count     5.000000
mean      3.000000
std       1.581139
min       1.000000
25%       2.000000
50%       3.000000
75%       4.000000
max       5.000000

In [31]:
df_product.head()

,MANUFACTURER,BRAND,ITEM,ITEM_DESCRIPTION,CATEGORY,FORMAT,ATTR1,ATTR2,ATTR3
0,INDS. ALEN,CLORALEX,0000075000592,CLORALEX EL RENDIDOR BOT.PLAST. 250ML NAL. 000...,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO
1,INDS. ALEN,CLORALEX,0000075000608,CLORALEX EL RENDIDOR BOT.PLAST. 500ML NAL. 000...,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO
2,INDS. ALEN,CLORALEX,0000075000615,CLORALEX EL RENDIDOR BOT.PLAST. 950ML NAL. 000...,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO
3,INDS. ALEN,CLORALEX,0000075000622,CLORALEX EL RENDIDOR BOT.PLAST. 2000ML NAL 000...,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO
4,INDS. ALEN,CLORALEX,0000075000639,CLORALEX EL RENDIDOR BOT.PLAST. 3750ML NAL 000...,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO

In [32]:
df_product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 505 entries, 0 to 504
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   MANUFACTURER      505 non-null    object
 1   BRAND             505 non-null    object
 2   ITEM              503 non-null    object
 3   ITEM_DESCRIPTION  505 non-null    object
 4   CATEGORY          505 non-null    int64
 5   FORMAT            505 non-null    object
 6   ATTR1             499 non-null    object
 7   ATTR2             505 non-null    object
 8   ATTR3             499 non-null    object
dtypes: int64(1), object(8)
memory usage: 35.6+ KB

In [33]:
df_product.describe()

       CATEGORY
count     505.0
mean        1.0
std         0.0
min         1.0
25%         1.0
50%         1.0
75%         1.0
max         1.0

In [34]:
df_segment.head()

   CATEGORY  ATTR1  ATTR2      ATTR3   FORMAT SEGMENT
0         1  CLORO  CLORO    BAMBINO  LIQUIDO  BLEACH
1         1  CLORO  CLORO  GERMICIDA  LIQUIDO  BLEACH
2         1  CLORO  CLORO   MASCOTAS  LIQUIDO  BLEACH
3         1  CLORO  CLORO  MULTIUSOS      GEL  BLEACH
4         1  CLORO  CLORO  MULTIUSOS  LIQUIDO  BLEACH

In [36]:
df_segment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CATEGORY  53 non-null     int64
 1   ATTR1     53 non-null     object
 2   ATTR2     53 non-null     object
 3   ATTR3     52 non-null     object
 4   FORMAT    53 non-null     object
 5   SEGMENT   53 non-null     object
dtypes: int64(1), object(5)
memory usage: 2.6+ KB

In [37]:
df_segment.describe()

       CATEGORY
count      53.0
mean        1.0
std         0.0
min         1.0
25%         1.0
50%         1.0
75%         1.0
max         1.0

In [38]:
df_fact_sales.head()

,WEEK,ITEM_CODE,TOTAL_UNIT_SALES,TOTAL_VALUE_SALES,TOTAL_UNIT_AVG_WEEKLY_SALES,REGION
0,34-22,7501058792808BP2,0.006,0.139,1.000,TOTAL AUTOS AREA 5
1,34-22,7501058715883,0.487,116.519,2.916,TOTAL AUTOS AREA 5
2,34-22,7702626213774,1.391,68.453,5.171,TOTAL AUTOS AREA 5
3,34-22,7501058716422,0.022,1.481,1.833,TOTAL AUTOS AREA 5
4,34-22,7501058784353,2.037,182.839,5.375,TOTAL AUTOS AREA 5

In [39]:
df_fact_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122002 entries, 0 to 122001
Data columns (total 6 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   WEEK                         122002 non-null  object
 1   ITEM_CODE                    122002 non-null  object
 2   TOTAL_UNIT_SALES             122002 non-null  float64
 3   TOTAL_VALUE_SALES            122002 non-null  float64
 4   TOTAL_UNIT_AVG_WEEKLY_SALES  122002 non-null  float64
 5   REGION                       122002 non-null  object
dtypes: float64(3), object(3)
memory usage: 5.6+ MB

In [40]:
df_fact_sales.describe()

       TOTAL_UNIT_SALES  TOTAL_VALUE_SALES  TOTAL_UNIT_AVG_WEEKLY_SALES
count     122002.000000      122002.000000                122002.000000
mean           3.211097          90.513761                    10.099904
std           14.496009         350.236505                    22.650142
min            0.000000           0.001000                     0.042000
25%            0.063000           2.662000                     2.316000
50%            0.367000          16.812000                     3.993500
75%            1.520000          62.961500                     8.898000
max          504.681000       12236.759000                   794.000000

## Limpieza de los datos

In [43]:
#Revisar si existen valores duplicados
df_calendar = df_calendar.drop_duplicates()

In [44]:
df_calendar.describe()

              YEAR       MONTH  WEEK_NUMBER                 DATE
count   156.000000  156.000000   156.000000                  156
mean   2022.000000    6.487179    26.500000  2022-07-06 20:00:00
min    2021.000000    1.000000     1.000000  2021-01-10 00:00:00
25%    2021.000000    3.750000    13.750000  2021-10-08 06:00:00
50%    2022.000000    6.500000    26.500000  2022-07-06 12:00:00
75%    2023.000000    9.250000    39.250000  2023-04-04 18:00:00
max    2023.000000   12.000000    52.000000  2024-01-01 00:00:00
std       0.819126    3.459419    15.056667                  NaN

In [45]:
df_category = df_category.drop_duplicates()
df_category.describe()

       ID_CATEGORY
count     5.000000
mean      3.000000
std       1.581139
min       1.000000
25%       2.000000
50%       3.000000
75%       4.000000
max       5.000000

In [46]:
df_product = df_product.drop_duplicates()
df_product.describe()

       CATEGORY
count     505.0
mean        1.0
std         0.0
min         1.0
25%         1.0
50%         1.0
75%         1.0
max         1.0

In [47]:
df_segment = df_segment.drop_duplicates()
df_segment.describe()

       CATEGORY
count      53.0
mean        1.0
std         0.0
min         1.0
25%         1.0
50%         1.0
75%         1.0
max         1.0

In [49]:
df_segment = df_segment.drop_duplicates()
df_segment.describe()

       CATEGORY
count      53.0
mean        1.0
std         0.0
min         1.0
25%         1.0
50%         1.0
75%         1.0
max         1.0

In [51]:
df_fact_sales = df_fact_sales.drop_duplicates()
df_fact_sales.describe()

       TOTAL_UNIT_SALES  TOTAL_VALUE_SALES  TOTAL_UNIT_AVG_WEEKLY_SALES
count     122002.000000      122002.000000                122002.000000
mean           3.211097          90.513761                    10.099904
std           14.496009         350.236505                    22.650142
min            0.000000           0.001000                     0.042000
25%            0.063000           2.662000                     2.316000
50%            0.367000          16.812000                     3.993500
75%            1.520000          62.961500                     8.898000
max          504.681000       12236.759000                   794.000000

In [57]:
#Voy a coreegir la descripcion de la categoria 1 que contiene caracteres en la descripcion
df_category.iloc[0]

ID_CATEGORY                                 1
CATEGORY       FABRIC TREATMENT and SANIT\r\n
Name: 0, dtype: object

In [58]:
#Voy a poner el valor correcto
df_category.at[0, 'CATEGORY'] = 'FABRIC TREATMENT and SANIT'

In [59]:
df_category.iloc[0]

ID_CATEGORY                             1
CATEGORY       FABRIC TREATMENT and SANIT
Name: 0, dtype: object

In [65]:
#Voy a revisar si existen valores en cero Faltantes por columna = fpc
fpc1 = df_calendar.isnull().sum()
fpc2 = df_category.isnull().sum()
fpc3 = df_product.isnull().sum()
fpc4 = df_segment.isnull().sum()
fpc5 = df_fact_sales.isnull().sum()
print(f"Existen estos faltantes para calendar, {fpc1}")

Existen estos faltantes para calendar, WEEK           0
YEAR           0
MONTH          0
WEEK_NUMBER    0
DATE           0
dtype: int64

In [66]:
print(f"Existen estos faltantes para category, {fpc2}")

Existen estos faltantes para category, ID_CATEGORY    0
CATEGORY       0
dtype: int64

In [67]:
print(f"Existen estos faltantes para product, {fpc3}")

Existen estos faltantes para product, MANUFACTURER        0
BRAND               0
ITEM                2
ITEM_DESCRIPTION    0
CATEGORY            0
FORMAT              0
ATTR1               6
ATTR2               0
ATTR3               6
dtype: int64

In [69]:
print(f"Existen estos faltantes para segment, {fpc4}")

Existen estos faltantes para segment, CATEGORY    0
ATTR1       0
ATTR2       0
ATTR3       1
FORMAT      0
SEGMENT     0
dtype: int64

In [70]:
print(f"Existen estos faltantes para sales, {fpc5}")

Existen estos faltantes para sales, WEEK                           0
ITEM_CODE                      0
TOTAL_UNIT_SALES               0
TOTAL_VALUE_SALES              0
TOTAL_UNIT_AVG_WEEKLY_SALES    0
REGION                         0
dtype: int64

In [71]:
df_product = df_product.fillna(0)
df_segment = df_segment.fillna(0)

In [72]:
fpc3 = df_product.isnull().sum()
fpc4 = df_segment.isnull().sum()
print(f"Existen estos faltantes para calendar, {fpc3}")
print(f"Existen estos faltantes para calendar, {fpc4}")

Existen estos faltantes para calendar, MANUFACTURER        0
BRAND               0
ITEM                0
ITEM_DESCRIPTION    0
CATEGORY            0
FORMAT              0
ATTR1               0
ATTR2               0
ATTR3               0
dtype: int64
Existen estos faltantes para calendar, CATEGORY    0
ATTR1       0
ATTR2       0
ATTR3       0
FORMAT      0
SEGMENT     0
dtype: int64

In [84]:
#Voy a hacer una pivot table para ver los valores que tengo por region en la tabla de facturacion
df_fact_sales_pivote = pd.pivot_table(df_fact_sales, index = ['REGION','ITEM_CODE', 'WEEK'],  columns = [] , aggfunc = 'sum')
df_fact_sales_pivote

                                                 TOTAL_UNIT_AVG_WEEKLY_SALES  \
REGION                      ITEM_CODE     WEEK
TOTAL AUTOS AREA 1          0000075000592 01-22                        2.667
                                          01-23                        1.000
                                          02-22                       15.917
                                          02-23                       12.500
                                          03-22                       26.667
...                                                                      ...
TOTAL AUTOS SCANNING MEXICO 8411660210036 48-22                        1.964
                                          49-22                        1.881
                                          50-22                        1.933
                                          51-22                        1.870
                                          52-22                        1.798

                                                 TOTAL_UNIT_SALES  \
REGION                      ITEM_CODE     WEEK
TOTAL AUTOS AREA 1          0000075000592 01-22             0.008
                                          01-23             0.001
                                          02-22             0.191
                                          02-23             0.025
                                          03-22             0.320
...                                                           ...
TOTAL AUTOS SCANNING MEXICO 8411660210036 48-22             0.330
                                          49-22             0.331
                                          50-22             0.346
                                          51-22             0.325
                                          52-22             0.340

                                                 TOTAL_VALUE_SALES
REGION                      ITEM_CODE     WEEK
TOTAL AUTOS AREA 1          0000075000592 01-22              0.036
                                          01-23              0.001
                                          02-22              0.854
                                          02-23              0.053
                                          03-22              1.454
...                                                            ...
TOTAL AUTOS SCANNING MEXICO 8411660210036 48-22             23.234
                                          49-22             23.307
                                          50-22             24.323
                                          51-22             22.807
                                          52-22             23.899

[122002 rows x 3 columns]

In [73]:
df_fact_sales.head()

,WEEK,ITEM_CODE,TOTAL_UNIT_SALES,TOTAL_VALUE_SALES,TOTAL_UNIT_AVG_WEEKLY_SALES,REGION
0,34-22,7501058792808BP2,0.006,0.139,1.000,TOTAL AUTOS AREA 5
1,34-22,7501058715883,0.487,116.519,2.916,TOTAL AUTOS AREA 5
2,34-22,7702626213774,1.391,68.453,5.171,TOTAL AUTOS AREA 5
3,34-22,7501058716422,0.022,1.481,1.833,TOTAL AUTOS AREA 5
4,34-22,7501058784353,2.037,182.839,5.375,TOTAL AUTOS AREA 5